[{"NameSpace":{"Comments":null,"Name":"Using Facebook"},"Directives":null,"ClassDefination":{"Comments":null,"Name":"Friending"},"Methods":[{"Comments":["Click the search bar in the top left of any Facebook page.","Type your friend's name into the search bar and click","To send someone a friend request, click next to their profile picture. Some people might not have next to their profile picture, depending on their privacy settings."],"ReturnType":null,"Name":"How do I find and add friends on Facebook?To find and add a friend by name on a computer:"},{"Comments":["Go to facebook.com/find-friends.","Click Confirm."],"ReturnType":null,"Name":"How do I accept a friend request on Facebook?"},{"Comments":["Go to facebook.com/find-friends.","Click Delete or Delete Request."],"ReturnType":null,"Name":"How do I delete a friend request on Facebook?"},{"Comments":["Go to your View Sent Requests or search for the person you previously sent a friend request to.","Select Cancel Request."],"ReturnType":null,"Name":"How do I cancel a friend request I sent to someone on Facebook?"},{"Comments":["Open Facebook and enter your friend's name in the search bar at the top.","Click People in the left menu.","You can choose to filter by city, education, work and mutual friends."],"ReturnType":null,"Name":"I can't find my friend on Facebook."},{"Comments":["Go to your friend's profile by typing their name into the search bar in the top left corner of any Facebook page.","Click to the right.","Click See Friendship."],"ReturnType":null,"Name":"How do I see a friendship page on Facebook?"},{"Comments":["Click in the top right of Facebook.","Click Settings & Privacy > Settings.","Click Privacy in the left column.","Click Edit next to Who can send you friend requests?.","From the dropdown menu, click Everyone or Friends of Friends.","Use the first and last name you use in everyday life.","If people know you by a different name (example: nickname, maiden name), add another name to your account.","Add your basic info."],"ReturnType":null,"Name":"How do I change who can add me as a friend on Facebook?To change who can add you as a friend:"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","Click Public Posts on the left.","Select Friends or Public next to Who Can Follow Me.","Public Post Comments: Allows you to select who can comment on your public posts. Learn how to adjust who can like or comment on your public posts.","Public Post Notifications: Allows you to select if you want to get notifications when people who aren't your friends start following you and share, like or comment on your public posts.","Public Profile Info: Allows you to select who can like or comment on changes to your Intro section that is part of your public profile. This includes changes to profile photos, profile videos, cover photos, featured photos and News Feed updates. Learn how to adjust who can like or comment on your public profile information."],"ReturnType":null,"Name":"Who can follow me on Facebook?To manage who can follow you:"},{"Comments":["Go to facebook.com/find-friends.","Click Delete or Delete Request."],"ReturnType":null,"Name":"How do I delete a friend request on Facebook?"},{"Comments":["From the Facebook for iPhone or Android app, tap .","Tap Find Friends.","Tap Upload Contacts on the bottom banner, then tap Get Started."],"ReturnType":null,"Name":"How do I upload my contacts to Facebook from my mobile phone or other accounts?To upload your mobile phone contacts to Facebook:"},{"Comments":["Go to the Uploading and Managing Your Contacts screen.","Click Delete All."],"ReturnType":null,"Name":"How do I delete contacts I uploaded to Facebook?"}],"Properties":null}]