[{"NameSpace":{"Comments":null,"Name":"Using Facebook"},"Directives":null,"ClassDefination":{"Comments":null,"Name":"Facebook Pay"},"Methods":[{"Comments":["Visit your Payment History.","Below Subscriptions, click Cancel Subscription next to the subscription you want to cancel."],"ReturnType":null,"Name":"How can I cancel a Facebook game or app subscription?"},{"Comments":["Click Add New Payment Method.","To add your credit or debit card, select Add New Card.","You'll now be prompted to enter your payment details. Click Buy when you've finished this.","Select Mobile Phone and the country associated with it.","You'll now be prompted to enter your mobile phone number. Click Continue once you've done this.","Our mobile payment providers, Zong and Boku, will send you a text with instructions. Your computer screen will also update with directions when necessary. Please note, charges go on your wireless bill or prepaid account.","If you're having trouble completing a payment with your mobile phone, let us know."],"ReturnType":null,"Name":"How do I make an in-game purchase on Facebook?"},{"Comments":["Click Add New Payment Method.","To add your credit or debit card, select Add New Card.","You'll now be prompted to enter your payment details. Click Buy when you've finished this.","Select Mobile Phone and the country associated with it.","You'll now be prompted to enter your mobile phone number. Click Continue once you've done this.","Our mobile payment providers, Zong and Boku, will send you a text with instructions. Your computer screen will also update with directions when necessary. Please note, charges go on your wireless bill or prepaid account.","If you're having trouble completing a payment with your mobile phone, let us know."],"ReturnType":null,"Name":"How do I make an in-game purchase on Facebook?"},{"Comments":["Visit PayPal and log into your account.","Click the Settings cog in the top-right corner.","Click Payments.","Click Manage pre-approved payments.","You should see Facebook, Inc. listed as one of your merchants.","Click Set Available Funding Sources.","Choose which payment method you'd like to use for future Facebook payments and then click Save.","Select the game you want to make a purchase in.","Choose the item or currency you want to purchase.","Below Select Payment Method, select PayPal."],"ReturnType":null,"Name":"How do I update my primary PayPal payment method for use on Facebook?"},{"Comments":["Visit PayPal and log into your account.","Click the Settings cog in the top-right corner.","Click Payments.","Click Manage pre-approved payments.","You should see Facebook, Inc. listed as one of your merchants.","Click Set Available Funding Sources.","Choose which payment method you'd like to use for future Facebook payments and then click Save.","Select the game you want to make a purchase in.","Choose the item or currency you want to purchase.","Below Select Payment Method, select PayPal."],"ReturnType":null,"Name":"How do I update my primary PayPal payment method for use on Facebook?"},{"Comments":["From your News Feed, click in the top right.","Select Settings & Privacy, then click Settings.","From the left menu, select Facebook Pay.","To add a payment method to the Payment Methods section, select Add Credit or Debit Card.","To remove a payment method, click your card then click Remove Card > Remove."],"ReturnType":null,"Name":"How do I add or remove a payment method from my Facebook account?To add or remove a payment method:"},{"Comments":["Visit your Facebook Pay Settings.","Click Currency to update your preferred currency.","Click Save."],"ReturnType":null,"Name":"How do I change my preferred currency for payments I make on Facebook?"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","Click Facebook Pay in the left menu.","Under Activity, select the transaction to see the details."],"ReturnType":null,"Name":"Where can I see my payment activity on Facebook?"},{"Comments":["Click the desired payment to view your receipt and verify that your payment was successfully completed.","If you've confirmed you haven't received your in-game items and it's been more than 4 hours, notify the developer of the game by clicking Contact Customer Support on the receipt and follow the instructions by selecting Didn't receive in-game item(s) I purchased and then selecting the payment you didn't receive items for."],"ReturnType":null,"Name":"I was charged by Facebook, but I didn't receive my in-game item."},{"Comments":["Open the app or game.","Click Report/Contact in the bottom-right corner."],"ReturnType":null,"Name":"How do I contact the developer of an app or game on Facebook?"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","Click Apps and Websites in the left menu.","Click View and edit next to an app or game.","Scroll down to LEARN MORE. Your user ID is in the paragraph below."],"ReturnType":null,"Name":"How do I find my user ID for my apps and games on Facebook?"},{"Comments":["Your friends, if you choose to share it","The fundraiser creator","The organization or group the funds benefit (for nonprofit fundraisers)","On Facebook, find the fundraiser you want to donate to.","Click Donate.","Enter the amount you want to donate.","Enter your payment details.","Set your privacy preference under “Who can see that you donated?” at the bottom."],"ReturnType":null,"Name":"Will my donation on Facebook be seen by my friends?Choose who can see your donation"},{"Comments":["Click What's on your mind, [Name]? at the top of your Facebook News Feed.","Click then select Raise Money.","Enter the organization you want to raise money for and select it from the menu.","Write a post about your cause and click Post."],"ReturnType":null,"Name":"How do I add a donate button to my Facebook post?"},{"Comments":["Go to the fundraiser you'd like to invite friends to.","Below Invite Friends, click Invite next to the friends you want to invite to contribute to the fundraiser."],"ReturnType":null,"Name":"How do I invite people to donate to a fundraiser on Facebook?"},{"Comments":["A tax identification number for you or your company, depending on who will receive the payments.","A bank account that can receive payments in USD. See what steps you can take if your account can't accept USD. Please note that Audience Network does not pay to PayPal accounts.","Go to Monetization Manager.","Click on Manage next to the property you'd like to add payout information to.","Click Property Settings, then Payouts.","Click Add Payments Account."],"ReturnType":null,"Name":"How do I add my payment information on Facebook in order to get paid?Before you get started, you'll need:"},{"Comments":["Visit your Payouts portal.","From the dropdown menu, select your company name.","Select Settings and follow the onscreen instructions."],"ReturnType":null,"Name":"How do I update my payout account information on Facebook?"},{"Comments":["Visit the Monetization Manager.","Click Manage next to your desired property.","Click Property Settings > Payouts.","Click Payout History."],"ReturnType":null,"Name":"Where is my Audience Network payment?"},{"Comments":["Verify that you have accumulated at least $100 in revenue","Contact your bank to ensure they haven't rejected the payment and that your bank account is able to receive payments in USD","Review your payout account information to confirm it's still accurate"],"ReturnType":null,"Name":"Steps to take prior to contacting support about missing payments"}],"Properties":null}]