[{"NameSpace":{"Comments":null,"Name":"Using Facebook"},"Directives":null,"ClassDefination":{"Comments":null,"Name":"Friending"},"Methods":[{"Comments":["Click the search bar in the top left of any Facebook page.","Type your friend's name into the search bar and click","To send someone a friend request, click next to their profile picture. Some people might not have next to their profile picture, depending on their privacy settings."],"ReturnType":null,"Name":"How do I find and add friends on Facebook?To find and add a friend by name on a computer:"},{"Comments":["Go to facebook.com/find-friends.","Click Confirm."],"ReturnType":null,"Name":"How do I accept a friend request on Facebook?"},{"Comments":["Go to facebook.com/find-friends.","Click Delete or Delete Request."],"ReturnType":null,"Name":"How do I delete a friend request on Facebook?"},{"Comments":["Go to your View Sent Requests or search for the person you previously sent a friend request to.","Select Cancel Request."],"ReturnType":null,"Name":"How do I cancel a friend request I sent to someone on Facebook?"},{"Comments":["Open Facebook and enter your friend's name in the search bar at the top.","Click People in the left menu.","You can choose to filter by city, education, work and mutual friends."],"ReturnType":null,"Name":"I can't find my friend on Facebook."},{"Comments":["Go to your friend's profile by typing their name into the search bar in the top left corner of any Facebook page.","Click to the right.","Click See Friendship."],"ReturnType":null,"Name":"How do I see a friendship page on Facebook?"},{"Comments":["Click in the top right of Facebook.","Click Settings & Privacy > Settings.","Click Privacy in the left column.","Click Edit next to Who can send you friend requests?.","From the dropdown menu, click Everyone or Friends of Friends.","Use the first and last name you use in everyday life.","If people know you by a different name (example: nickname, maiden name), add another name to your account.","Add your basic info."],"ReturnType":null,"Name":"How do I change who can add me as a friend on Facebook?To change who can add you as a friend:"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","Click Public Posts on the left.","Select Friends or Public next to Who Can Follow Me.","Public Post Comments: Allows you to select who can comment on your public posts. Learn how to adjust who can like or comment on your public posts.","Public Post Notifications: Allows you to select if you want to get notifications when people who aren't your friends start following you and share, like or comment on your public posts.","Public Profile Info: Allows you to select who can like or comment on changes to your Intro section that is part of your public profile. This includes changes to profile photos, profile videos, cover photos, featured photos and News Feed updates. Learn how to adjust who can like or comment on your public profile information."],"ReturnType":null,"Name":"Who can follow me on Facebook?To manage who can follow you:"},{"Comments":["Go to facebook.com/find-friends.","Click Delete or Delete Request."],"ReturnType":null,"Name":"How do I delete a friend request on Facebook?"},{"Comments":["From the Facebook for iPhone or Android app, tap .","Tap Find Friends.","Tap Upload Contacts on the bottom banner, then tap Get Started."],"ReturnType":null,"Name":"How do I upload my contacts to Facebook from my mobile phone or other accounts?To upload your mobile phone contacts to Facebook:"},{"Comments":["Go to the Uploading and Managing Your Contacts screen.","Click Delete All."],"ReturnType":null,"Name":"How do I delete contacts I uploaded to Facebook?"}],"Properties":null},{"NameSpace":{"Comments":null,"Name":"Using Facebook"},"Directives":null,"ClassDefination":{"Comments":null,"Name":"Your Home Page"},"Methods":[{"Comments":["How often you interact with posts from friends, groups or Pages (friends and family are prioritized).","If the type of post is something you often interact with (example: photo, video, link).","The number of comments, likes, reactions and shares a post receives from the people and Pages that see it. Keep in mind that these posts are shared by the friends, groups or Pages you follow.","How recently something was posted.","Your past interactions on posts of friends or Pages, like reacting to or commenting on a photo or video.","Things you have in common, like mutual friends or groups you both belong to.","Select a person or Page to add to Favorites.","Snooze a person, Page or group.","Hide or unfollow posts from people, Pages or groups.","Go to the post.","Click in the top right and select Why am I seeing this post?"],"ReturnType":null,"Name":"What influences the order of posts in my Facebook News Feed?What influences ranking"},{"Comments":["Click in the top right of Facebook.","Select Settings and Privacy, then click News Feed Preferences.","Click Favorites to select people and Pages that you want to prioritize. This means their posts will be shown higher in your News Feed. Learn about favorites.","Click Unfollow to unfollow a person, Page or group. Learn about unfollowing.","Click Reconnect to follow a person, Page or group that you unfollowed in the past. Learn about reconnecting.","Click Snooze to restart, stop or add more time to your snoozes. Learn about snoozing."],"ReturnType":null,"Name":"How can I view and adjust my Facebook News Feed preferences?"},{"Comments":["Click in the top right of the post in your News Feed.","Click Snooze [Name] for 30 days.","To immediately undo Snooze [Name] for 30 days, click Undo in the confirmation message."],"ReturnType":null,"Name":"How do I snooze a person, Page or group on Facebook?"},{"Comments":["Click at the top of Facebook.","Click See More in the left menu.","Select Most Recent."],"ReturnType":null,"Name":"How do I view posts on my News Feed in most recent order on Facebook?"},{"Comments":["Click in the top right of Facebook.","Select Settings and Privacy > News Feed Preferences.","Click Reconnect.","Click next to the name of the person, Page or group you'd like to follow.","Click near their cover photo, then click Follow (on a Page) or click Follow group (in a group)."],"ReturnType":null,"Name":"How do I reconnect with a person, Page or group on Facebook that I unfollowed?"},{"Comments":["Click in the top right of Facebook.","Select Settings and Privacy > News Feed Preferences.","Click Reconnect.","Click next to the name of the person, Page or group you'd like to follow.","Click near their cover photo, then click Follow (on a Page) or click Follow group (in a group)."],"ReturnType":null,"Name":"How do I reconnect with a person, Page or group on Facebook that I unfollowed?"},{"Comments":["Click the search bar at the top of any page on Facebook.","Enter the name of the person and choose from the results.","Go to the profile you want to follow.","Click .","Click the search bar at the top of any page on Facebook.","Enter the name of the Page and choose from the results.","Go to the Page you want to follow.","Click .","Click Follow."],"ReturnType":null,"Name":"How do I follow a profile or Page on Facebook?"},{"Comments":["Click the search bar at the top of any page on Facebook.","Enter the name of the person and choose from the results.","Go to the profile you want to follow.","Click .","Click the search bar at the top of any page on Facebook.","Enter the name of the Page and choose from the results.","Go to the Page you want to follow.","Click .","Click Follow."],"ReturnType":null,"Name":"How do I follow a profile or Page on Facebook?"},{"Comments":["Below a post, click Share in the bottom right.","Select where you want to share the post. Depending on the post's privacy settings, you may see the following options:\r\nShare Now\r\nShare...\r\nShare to Your Story Now\r\nSend As Message\r\nShare in a Group\r\nShare on a Friend's Timeline\r\nShare to a Page"],"ReturnType":null,"Name":"How do I share a post I see on my News Feed on Facebook?"},{"Comments":["Go to the post or photo.","Click Like to unlike.","Go to the comment.","Click Like to unlike.","Go to the Page.","Click Liked."],"ReturnType":null,"Name":"How do I unlike something on Facebook?"},{"Comments":["Go to the post or photo.","Click Like to unlike.","Go to the comment.","Click Like to unlike.","Go to the Page.","Click Liked."],"ReturnType":null,"Name":"How do I unlike something on Facebook?"},{"Comments":["Go to the post or photo.","Click Like to unlike.","Go to the comment.","Click Like to unlike.","Go to the Page.","Click Liked."],"ReturnType":null,"Name":"How do I unlike something on Facebook?"},{"Comments":["Click the search bar at the top of any page on Facebook.","Enter what you're looking for and choose from the results.","Type something into the search bar at the top of any Facebook page or select a search prediction.","Click a filter at the top (example: People, Photos) to narrow your search."],"ReturnType":null,"Name":"How do I search for something on Facebook?To search for something:"},{"Comments":["Click the search bar at the top of any page on Facebook.","Enter what you're looking for and choose from the results.","Type something into the search bar at the top of any Facebook page or select a search prediction.","Click a filter at the top (example: People, Photos) to narrow your search."],"ReturnType":null,"Name":"How do I search for something on Facebook?To search for something:To filter your search results:"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","Click Language and Region.","Click Language you'd like to have posts translated into.","Select a language and click Save Changes."],"ReturnType":null,"Name":"How do I change the language that Facebook posts or comments are translated to?"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","Click Language and Region in the left menu.","Click Languages you don't want to be offered translations for.","Enter a language and click Save Changes."],"ReturnType":null,"Name":"How do I turn off translations options for posts and comments on Facebook written in a specific language?"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","Click Language and Region.","Click Languages you don't want automatically translated.","Search for the languages you don't want to be automatically translated, then click to select the language.","Click Save Changes."],"ReturnType":null,"Name":"How do I stop posts written in another language from being automatically translated on Facebook?"},{"Comments":["Click See Translation.","Click Rate this translation.","Click a star to rate the translation."],"ReturnType":null,"Name":"How do I rate the quality of a translated Facebook post?"},{"Comments":["Click See Translation under the post you'd like to report.","Click Rate this translation below the post.","Click Post was not in [Language] in the dropdown menu.","Select Confirm in the popup menu."],"ReturnType":null,"Name":"How do I report a Facebook post that was translated into the wrong language?"},{"Comments":["From the left menu, click Translate Facebook. You may need to click See More first."],"ReturnType":null,"Name":"How do I open the Translate Facebook app?Open the Translate Facebook App"},{"Comments":["Go to the Translate Facebook App.","Click Edit Settings.","Select a new Reference Language.","Click Submit."],"ReturnType":null,"Name":"How do I change the language I'm translating from?"},{"Comments":["Go to the Translate Facebook App.","Click Edit Settings at the top.","Select a new Translation Language.","Click Submit."],"ReturnType":null,"Name":"How do I change my translation language in the Translate Facebook app?"},{"Comments":["Click New Translation beneath the existing translations.","Enter your translation into the box.","Click Submit."],"ReturnType":null,"Name":"How do I write a new translation?"},{"Comments":["Rules for your specific language","Rules for all Facebook writing","The Facebook voice","Basics","Localization guidelines","Keep It Simple: Use short words and sentences, and keep the number of words to a minimum.","Get to the Point: Clearly explain how things work and give people enough information to make good decisions.","Talk Like a Person: Keep things friendly, conversational and respectful, like you’re talking to a neighbor.","Stick to common words that people use in everyday speech.","Be concise. Write short sentences that are easy to understand.","Keep terms and messaging consistent across all channels, on and off Facebook.","Don't bury information or gloss over it.","Don't use language that’s vague or possibly misleading.","Translate like you’re talking to someone one-on-one. Read your content out loud if you’re not sure it sounds natural.","Stay neutral. Avoid language that’s opinionated, cutesy, irreverent or otherwise over the top.","Don't sound like a robot. Even the smallest bits of interface content should be approachable","Use as few words as possible while still being clear.","Make sure every word has a job to do.","Replace jargon with everyday terms."],"ReturnType":null,"Name":"What style and tone should I use for writing translations?Rules for your specific language"},{"Comments":["Rules for your specific language","Rules for all Facebook writing","The Facebook voice","Basics","Localization guidelines","Keep It Simple: Use short words and sentences, and keep the number of words to a minimum.","Get to the Point: Clearly explain how things work and give people enough information to make good decisions.","Talk Like a Person: Keep things friendly, conversational and respectful, like you’re talking to a neighbor.","Stick to common words that people use in everyday speech.","Be concise. Write short sentences that are easy to understand.","Keep terms and messaging consistent across all channels, on and off Facebook.","Don't bury information or gloss over it.","Don't use language that’s vague or possibly misleading.","Translate like you’re talking to someone one-on-one. Read your content out loud if you’re not sure it sounds natural.","Stay neutral. Avoid language that’s opinionated, cutesy, irreverent or otherwise over the top.","Don't sound like a robot. Even the smallest bits of interface content should be approachable","Use as few words as possible while still being clear.","Make sure every word has a job to do.","Replace jargon with everyday terms."],"ReturnType":null,"Name":"What style and tone should I use for writing translations?Rules for your specific languageRules for all Facebook writing"},{"Comments":["Open the Translate Facebook App.","Click next to the best translation.","If none of the translations are correct, you can write a new one, or report incorrect or abusive translations."],"ReturnType":null,"Name":"How do I vote on existing translations in the Translate Facebook app?"},{"Comments":["Number","Viewing User","Subject Gender"],"ReturnType":null,"Name":"When should I use variations?"},{"Comments":["Open Translate Facebook.","Click New Translation.","Click Click here next to Translation depends on subject gender or viewer gender?.","Click the boxes to select the variations needed for the translation. Make sure to choose only the boxes that you need.","Click Save.","Enter the correct translation into the box below the variation description.","Click Submit."],"ReturnType":null,"Name":"How do I add variations to a new translation?"},{"Comments":["Open Translate Facebook.","Click New Translation.","Click Click here next to Translation depends on subject gender or viewer gender?.","Click the boxes to select the variations needed for the translation. Make sure to choose only the boxes that you need.","Click Save.","Enter the correct translation into the box below the variation description.","Click Submit."],"ReturnType":null,"Name":"How do I add variations to a new translation?"},{"Comments":["Go to the Translate Facebook app on a computer.","Find Monthly Leaderboard on the right, and click View All next to it.","Click Week or All time to change the time period."],"ReturnType":null,"Name":"How do I use the leaderboard for my language?"},{"Comments":["Open the Translate Facebook app.","Click Edit Settings.","Click the box next to Hide Identity on Leaderboard.","Click Submit."],"ReturnType":null,"Name":"How do I remove my translations from the leaderboard?"},{"Comments":["Click next to the translation that you're reporting.","Select the reason why you're reporting the translation."],"ReturnType":null,"Name":"How do I report an incorrect or abusive translation?"},{"Comments":["From your News Feed, click Memories in the left menu.","Click Share at the bottom of the memory you want to share.","Add an optional update and click Post."],"ReturnType":null,"Name":"How do I share a memory on Facebook?"},{"Comments":["Go to facebook.com/memories.","Click Notifications in the left menu.","Select None to turn off all notifications or Highlights to see less."],"ReturnType":null,"Name":"How do I turn notifications for Memories on or off on Facebook?"}],"Properties":null},{"NameSpace":{"Comments":null,"Name":"Using Facebook"},"Directives":null,"ClassDefination":{"Comments":null,"Name":"Messaging"},"Methods":[{"Comments":["From , click Messenger in the left menu.","Click to start a new message.","Start typing a name into the To field. Names of friends will appear.","Select the person or people you want to message.","Type your message, then press enter or to send."],"ReturnType":null,"Name":"How do I send a message on Facebook?"},{"Comments":["In the top right of your Facebook account, click .","Open the conversation you want to add a file to.","Click in the bottom of the chat window.","Click .","Select a file and click Open.","Press Enter to send."],"ReturnType":null,"Name":"How do I add a file to my message on Facebook?"},{"Comments":["In the top right of your Facebook account, click .","Open the conversation you want to add an emoji to","Click to send an emoji, to send a picture or to send a sticker.","Select an option and then press enter or to send."],"ReturnType":null,"Name":"How do I send a photo, emoji or sticker to someone on Facebook?"},{"Comments":["In the top right of your Facebook account, click .","Open a conversation.","Click , and then click .","Scroll to the sticker pack you want to remove and click Remove."],"ReturnType":null,"Name":"How do I delete sticker packs for my Facebook messages?"},{"Comments":["In the top right of your Facebook account, click .","Click to create a new message.","In the To: section, select or type the names of people you want to add to your chat.","Type your message, then click ."],"ReturnType":null,"Name":"How do I chat with more than one friend at once on Facebook?"},{"Comments":["In the top right of your Facebook account, click .","Go to the conversation.","Click .","Click Leave Group."],"ReturnType":null,"Name":"How do I leave a group conversation on Facebook?"},{"Comments":["From your News Feed, click Events in the left menu and select your event.","Below Guest List, click Message next to the name of the guest you'd like to message.","Enter a message and click ."],"ReturnType":null,"Name":"How do I send a message to my Facebook event guest list?Private Events"},{"Comments":["From your News Feed, click Pages in the left menu.","Go to the Page you want to message.","Click Send Message below the Page's cover photo.","Type your message and press enter to send."],"ReturnType":null,"Name":"How do I send a private message to a Facebook Page?"},{"Comments":["In the top right of your Facebook account, click .","Next to Messenger, click at the top.","Click Message Requests.","Reply with a message to start a conversation.","Click I don't want to hear from [Name]."],"ReturnType":null,"Name":"How do I check my message requests on Facebook?"},{"Comments":["In the top right of your Facebook account, click .","Click the conversation you want to delete.","At the top of the chat, click .","Click Delete conversation and then click Delete Conversation."],"ReturnType":null,"Name":"How do I delete a conversation on Facebook?"},{"Comments":["From , click Messenger in the left menu.","On the left below Chats, put your cursor on top of the conversation.","Click when you see it.","Click Hide Conversation."],"ReturnType":null,"Name":"How do I hide or archive a conversation on Facebook?"},{"Comments":["From , click Messenger in the left menu.","In the top left next to Chats, click .","Click Hidden Chats."],"ReturnType":null,"Name":"How do I view archived or hidden conversations on Facebook?"},{"Comments":["From , click Messenger in the left menu.","Below Chats, click Search Messenger in the top left.","Search for a contact name, the conversation name or keywords. If you're searching for a keyword, click Search Messages for \"[keyword]\".","From , click Messenger in the left menu.","Open the conversation you want to search.","Click in the top right.","Click Search in Conversation.","Search for a keyword in the search bar that appears at the top of the conversation."],"ReturnType":null,"Name":"How do I search for a conversation or message on Facebook chat?"},{"Comments":["From , click Messenger in the left menu.","Below Chats, click Search Messenger in the top left.","Search for a contact name, the conversation name or keywords. If you're searching for a keyword, click Search Messages for \"[keyword]\".","From , click Messenger in the left menu.","Open the conversation you want to search.","Click in the top right.","Click Search in Conversation.","Search for a keyword in the search bar that appears at the top of the conversation."],"ReturnType":null,"Name":"How do I search for a conversation or message on Facebook chat?"},{"Comments":["From your News Feed, click Messenger in the left menu.","Open the conversation with the person you'd like to block.","Click PRIVACY & SUPPORT in the right menu.","Click Block Messages, then Block Messages."],"ReturnType":null,"Name":"How do I block messages from someone on Facebook?"},{"Comments":["In the top right of your Facebook account, click .","Click the conversation you want to report.","At the top of the chat, click .","Click Something's Wrong.","Select Other and then select Spam.","Click Send Feedback and then click Done."],"ReturnType":null,"Name":"How do I report a message on Facebook as spam?"},{"Comments":["In the top right of your Facebook account, click .","Open a conversation with the person or people you want to video chat with.","Click in the top right corner of the chat window.","Click Call."],"ReturnType":null,"Name":"How do I video chat with someone or a group on Facebook?"}],"Properties":null},{"NameSpace":{"Comments":null,"Name":"Using Facebook"},"Directives":null,"ClassDefination":{"Comments":null,"Name":"Stories"},"Methods":[{"Comments":["Click + Create a Story at the top of your News Feed..","Click Create a Photo Story to add a photo or video from your computer.","Next to Your Story, you can click the audience selector (example: Publicor Friends) to choose who can see your story.","Click Share to Story."],"ReturnType":null,"Name":"How do I share a photo or video to my story on Facebook?"},{"Comments":["Below a post in your News Feed, tap Share.","Select Share to Your Story Now."],"ReturnType":null,"Name":"How do I share a News Feed post to my story on Facebook?"},{"Comments":["Open the Facebook app for iOS or Android.","Tap in the top right, then tap Events and select the event you'd like to share. Only upcoming public events can be shared.","Scroll down and tap Share > Your Story.","The event will appear as a sticker on your story. You can tap and hold the sticker to move it, or use two fingers to rotate the sticker or change the size.","To add more information, you can tap Aa to add text, to add a sticker, or to draw something.","Tap Done. Select your audience, then tap Share to Story."],"ReturnType":null,"Name":"How do I share an event to my story on Facebook?"},{"Comments":["Go to the Stories section at the top of your News Feed.","Click Your Story.","Click to find the photo or video you want to delete.","Click in the top right.","Click Delete Photo or Delete Video."],"ReturnType":null,"Name":"How do I delete a photo or video from my story on Facebook?"},{"Comments":["Open the Facebook app for iOS or Android.","Tap + Add to Story at the top of your News Feed.","At the top of the screen, scroll to the right and tap Music.","Tap to select a song. If you want to display music lyrics, select a song with the LYRICS label next to it.","Drag the slider left or right to select a clip from the song, then tap Done.","Tap to select a display style (example: Aa) then tap Done. You can choose music lyrics if they're available for your selected song, or different sticker formats with the song name and artist.","The song will appear on your story. You can tap to change the style, tap and hold to move it, or use two fingers to rotate it or change the size. To remove the song, drag it to at the bottom of the screen.","Tap the circle at the top of the screen (example: ) to change the background or add a photo or video from your camera roll.","Tap Share to Story.","Open the Facebook app for iOS or Android.","Tap + Add to Story at the top of your News Feed.","Tap then tap or MUSIC in the bottom right.","Tap to select a song.","Drag the slider left or right to select a clip from the song.","Tap or Start to record your video.","Tap to end your recording. The song clip will appear on your story.","Tap Share to Story."],"ReturnType":null,"Name":"How do I add music to my story on Facebook?To add music to your story:"},{"Comments":["Open the Facebook app for iOS or Android.","Tap + Add to Story at the top of your News Feed.","At the top of the screen, scroll to the right and tap Music.","Tap to select a song. If you want to display music lyrics, select a song with the LYRICS label next to it.","Drag the slider left or right to select a clip from the song, then tap Done.","Tap to select a display style (example: Aa) then tap Done. You can choose music lyrics if they're available for your selected song, or different sticker formats with the song name and artist.","The song will appear on your story. You can tap to change the style, tap and hold to move it, or use two fingers to rotate it or change the size. To remove the song, drag it to at the bottom of the screen.","Tap the circle at the top of the screen (example: ) to change the background or add a photo or video from your camera roll.","Tap Share to Story.","Open the Facebook app for iOS or Android.","Tap + Add to Story at the top of your News Feed.","Tap then tap or MUSIC in the bottom right.","Tap to select a song.","Drag the slider left or right to select a clip from the song.","Tap or Start to record your video.","Tap to end your recording. The song clip will appear on your story.","Tap Share to Story."],"ReturnType":null,"Name":"How do I add music to my story on Facebook?To add music to your story:To choose music before you record a video:"},{"Comments":["Go to the Stories section at the top of your News Feed and click + Create a Story.","Click Photo/Video to add your photo or video.","Hover over your photo or video and click Edit Photo.","Click Stickers below Edit Photo.","Click to select any sticker from the menu.","To edit most stickers, you can click to move it, or click to rotate it or change the size. To remove a sticker, click .","Click Save and then Post."],"ReturnType":null,"Name":"How do I add a sticker to my story on Facebook?"},{"Comments":["Open Facebook on an iOS or Android device.","At the top of your News Feed, tap + Add to Story.","Add your photo or video. You can tap a story type at the top (example: Boomerang) or select a photo or video from your camera roll. Tap Camera to take a new photo or video.","Tap in the top right, then tap POLL.","Type your question, then tap Yes or No to customize the answers.","Tap Done in the top right.","To change the audience for your story, you can tap Privacy in the bottom left.","Tap Share to Story."],"ReturnType":null,"Name":"How do I add a poll to my story on Facebook?"},{"Comments":["Open the Facebook app for iOS or Android.","At the top of your News Feed, tap + Add to Story.","Add your photo or video. You can tap the bottom left to choose a photo or video from your camera roll, or tap the bottom right to take a new photo or video using the camera.","Tap Aa in the top right, then add your text. You can also:\r\nTap the font name in the bottom right (example: Headline, Classic, Fancy) see different fonts.\r\nTap the colored circle on the left to change your text color.\r\nTap to change your text alignment.\r\nTap to add a solid or transparent background to your text. Tap again to remove it.","Tap the font name in the bottom right (example: Headline, Classic, Fancy) see different fonts.","Tap the colored circle on the left to change your text color.","Tap to change your text alignment.","Tap to add a solid or transparent background to your text. Tap again to remove it.","Tap Done in the top right.","After you add your text, you can tap and hold to move it, or use two fingers to rotate it or change the size. To remove your text, drag it to at the bottom of the screen.","Tap Share to Story."],"ReturnType":null,"Name":"How do I add text to my story on Facebook?"},{"Comments":["Open the Facebook app for iOS or Android.","Tap in the top left of your screen.","Tap to take a new photo or video, or tap Camera Roll to add a photo or video from your phone.","Tap in the top right, then tap Location.","Search for the place you'd like to tag, then select your location.","The location will appear on your story. You can tap to change the style, tap and hold to move it, or use two fingers to rotate it or change the size.","Tap Share to Story."],"ReturnType":null,"Name":"How do I add a location to my story on Facebook?"},{"Comments":["Add a photo or video to share to your story.","Next to Your Story in the bottom right, click the audience selector :\r\nPublic: Your Facebook friends, followers and people you've chatted with on Messenger will see your stories. Anyone who follows you can see your story, but only people you're friends with can reply.\r\nFriends: Only your Facebook friends will see your story on Facebook and the Messenger app. Your Messenger connections will not see your story.\r\nCustom: You can select specific people who will be able to see your stories.","Public: Your Facebook friends, followers and people you've chatted with on Messenger will see your stories. Anyone who follows you can see your story, but only people you're friends with can reply.","Friends: Only your Facebook friends will see your story on Facebook and the Messenger app. Your Messenger connections will not see your story.","Custom: You can select specific people who will be able to see your stories.","Open the Facebook app for iOS or Android.","Set your story privacy to Friends.","Tap Hide Story From .","Tap to select the people you'd like to hide your story from, then tap Save."],"ReturnType":null,"Name":"How do I choose who can see my story on Facebook?To change your story privacy settings:"},{"Comments":["Add a photo or video to share to your story.","Next to Your Story in the bottom right, click the audience selector :\r\nPublic: Your Facebook friends, followers and people you've chatted with on Messenger will see your stories. Anyone who follows you can see your story, but only people you're friends with can reply.\r\nFriends: Only your Facebook friends will see your story on Facebook and the Messenger app. Your Messenger connections will not see your story.\r\nCustom: You can select specific people who will be able to see your stories.","Public: Your Facebook friends, followers and people you've chatted with on Messenger will see your stories. Anyone who follows you can see your story, but only people you're friends with can reply.","Friends: Only your Facebook friends will see your story on Facebook and the Messenger app. Your Messenger connections will not see your story.","Custom: You can select specific people who will be able to see your stories.","Open the Facebook app for iOS or Android.","Set your story privacy to Friends.","Tap Hide Story From .","Tap to select the people you'd like to hide your story from, then tap Save."],"ReturnType":null,"Name":"How do I choose who can see my story on Facebook?To change your story privacy settings:To hide your story from specific people:"},{"Comments":["Go to the Stories section at the top of your News Feed.","Click Your Story.","Your story viewers will be listed below Story Details to the right. If you don't see this, no one has viewed your story yet."],"ReturnType":null,"Name":"How can I tell who's seen my story on Facebook?"},{"Comments":["Click your profile picture in the top right of Facebook.","Click Archive."],"ReturnType":null,"Name":"How do I find my Facebook story archive?"},{"Comments":["Click your profile picture in the top right of Facebook.","Click Archive.","Click in the top right.","Under Story Archive Setting, click Turn On Story Archive or Turn Off Story Archive."],"ReturnType":null,"Name":"How do I turn my Facebook story archive on or off?"},{"Comments":["Go to the Stories section at the top of your News Feed.","Click to view a story. From there, you can:\r\nSend a reply: Click Reply to [Name]... at the bottom of the story.\r\nSend a reaction: Click an emoji in the bottom right.","Send a reply: Click Reply to [Name]... at the bottom of the story.","Send a reaction: Click an emoji in the bottom right."],"ReturnType":null,"Name":"How do I reply or react to someone's story on Facebook?"},{"Comments":["Go to the Stories section at the top of your News Feed.","Click a story from the person, Page or group you'd like to mute.","Click in the top right of their story.","Click Mute [Username], then click Mute to confirm.","Go to the Stories section at the top of your News Feed.","Click to the right of the Stories section.","Click Settings.","Below Stories You've Muted, click Unmute next to the name of the person, Page or group."],"ReturnType":null,"Name":"How do I mute or unmute a story on Facebook?To mute a story:"},{"Comments":["Go to the Stories section at the top of your News Feed.","Click a story from the person, Page or group you'd like to mute.","Click in the top right of their story.","Click Mute [Username], then click Mute to confirm.","Go to the Stories section at the top of your News Feed.","Click to the right of the Stories section.","Click Settings.","Below Stories You've Muted, click Unmute next to the name of the person, Page or group."],"ReturnType":null,"Name":"How do I mute or unmute a story on Facebook?To mute a story:To unmute a story:"},{"Comments":["From your News Feed, go to the Stories section at the top and click to open the story.","Click to find the photo or video you want to report.","Click in the top right.","Click Give Feedback or Report Story, then follow the on-screen instructions."],"ReturnType":null,"Name":"How do I report a photo or video in a story on Facebook?"},{"Comments":["Go to your Page and tap your profile picture.","Tap Create story.","Select a photo or video from your camera roll and tap Next, or tap to take a new photo or video. From there you can:\r\nTap at the bottom of the screen to take a photo, or tap and hold to record a video.\r\nTap BOOMERANG to take a burst of photos that loops forward and backward.\r\nTap MUSIC to add a clip of a song to your photo or video.\r\nTap to change your story camera settings.\r\nTap to take a photo or video with masks or other camera effects.\r\nTap to upload a photo from your camera roll.","Tap at the bottom of the screen to take a photo, or tap and hold to record a video.","Tap BOOMERANG to take a burst of photos that loops forward and backward.","Tap MUSIC to add a clip of a song to your photo or video.","Tap to change your story camera settings.","Tap to take a photo or video with masks or other camera effects.","Tap to upload a photo from your camera roll.","After you take or add your photo or video, you can tap to add a sticker, Aa to add text or to draw on it. Tap Effects to add other creative effects to your photo or video, or Save to save it to your camera roll.","Tap Done, then tap Share Now to share your photo or video to your story.","Go to your Page and tap your profile picture.","Tap Create story.","Select a photo or video from your camera roll and tap Next, or tap to take a new photo or video. From there you can:\r\nTap at the bottom of the screen to take a photo, or tap and hold to record a video.\r\nTap BOOMERANG to take a burst of photos that loops forward and backward.\r\nTap to change your story camera settings.\r\nTap to take a photo or video with masks or other camera effects.\r\nTap to upload a photo from your camera roll.","Tap at the bottom of the screen to take a photo, or tap and hold to record a video.","Tap BOOMERANG to take a burst of photos that loops forward and backward.","Tap to change your story camera settings.","Tap to take a photo or video with masks or other camera effects.","Tap to upload a photo from your camera roll.","After you take or add your photo or video, you can tap to add a sticker, Aa to add text or to draw on it. Tap Effects to add other creative effects to your photo or video, or Save to save it to your camera roll.","Tap Done, then tap Share Now to share your photo or video to your story."],"ReturnType":null,"Name":"How do I share a photo or video to my Page's story on Facebook?Android"},{"Comments":["Go to your Page and tap your profile picture.","Tap Create story.","Select a photo or video from your camera roll and tap Next, or tap to take a new photo or video. From there you can:\r\nTap at the bottom of the screen to take a photo, or tap and hold to record a video.\r\nTap BOOMERANG to take a burst of photos that loops forward and backward.\r\nTap MUSIC to add a clip of a song to your photo or video.\r\nTap to change your story camera settings.\r\nTap to take a photo or video with masks or other camera effects.\r\nTap to upload a photo from your camera roll.","Tap at the bottom of the screen to take a photo, or tap and hold to record a video.","Tap BOOMERANG to take a burst of photos that loops forward and backward.","Tap MUSIC to add a clip of a song to your photo or video.","Tap to change your story camera settings.","Tap to take a photo or video with masks or other camera effects.","Tap to upload a photo from your camera roll.","After you take or add your photo or video, you can tap to add a sticker, Aa to add text or to draw on it. Tap Effects to add other creative effects to your photo or video, or Save to save it to your camera roll.","Tap Done, then tap Share Now to share your photo or video to your story.","Go to your Page and tap your profile picture.","Tap Create story.","Select a photo or video from your camera roll and tap Next, or tap to take a new photo or video. From there you can:\r\nTap at the bottom of the screen to take a photo, or tap and hold to record a video.\r\nTap BOOMERANG to take a burst of photos that loops forward and backward.\r\nTap to change your story camera settings.\r\nTap to take a photo or video with masks or other camera effects.\r\nTap to upload a photo from your camera roll.","Tap at the bottom of the screen to take a photo, or tap and hold to record a video.","Tap BOOMERANG to take a burst of photos that loops forward and backward.","Tap to change your story camera settings.","Tap to take a photo or video with masks or other camera effects.","Tap to upload a photo from your camera roll.","After you take or add your photo or video, you can tap to add a sticker, Aa to add text or to draw on it. Tap Effects to add other creative effects to your photo or video, or Save to save it to your camera roll.","Tap Done, then tap Share Now to share your photo or video to your story."],"ReturnType":null,"Name":"How do I share a photo or video to my Page's story on Facebook?AndroidiPhone"},{"Comments":["From your News Feed, click Pages in the left menu.","Go to your Page, and click Insights in the left menu.","Click Stories on the left. If it's your first time, click Turn On."],"ReturnType":null,"Name":"How do I see insights about my Page's stories?To see your Stories Insights:"},{"Comments":["From your News Feed, click Pages in the left menu.","Go to your Page.","Click Publishing Tools in the left menu.","Click Story Archive in the top left.","Click Turn On to turn on your story archive. To turn off story archive, click > Turn off"],"ReturnType":null,"Name":"How do I turn my Facebook Page's story archive on or off?"},{"Comments":["Open the Facebook app for iOS or Android.","Tap + Add to Page's Story at the top of your News Feed.","Select a photo or video from your camera roll, or tap to take a new photo or video.","Tap in the top right, then select a sticker (example: MUSIC, LOCATION).","To edit most stickers, you can tap to change the style, tap and hold to move it, or use two fingers to rotate it or change the size. To remove a sticker, drag it to at the bottom of the screen.","Tap Share to Story."],"ReturnType":null,"Name":"How do I add a sticker to my Page's story on Facebook?"},{"Comments":["Open the Facebook app for iOS or Android.","Tap + Add to Page's Story at the top of your News Feed.","Select a photo or video from your camera roll, or tap to take a new photo or video.","Tap in the top right, then tap MUSIC.","Tap to select a song. If you want to display music lyrics, select a song with the LYRICS label next to it.","Drag the slider left or right to select a clip from the song.","Tap to select a display style (example: Aa) then tap Done. You can choose music lyrics if they're available for your selected song, or different sticker formats with the song name and artist.","When the song is added to your photo or video, you can tap to change the style, and if you've chosen a music sticker, you can tap and hold to move it, or use two fingers to rotate it or change the size. To remove the song, drag it to at the bottom of the screen.","Tap Share to Story."],"ReturnType":null,"Name":"How do I add music to my Page's story on Facebook?To add music to your Page's story:"}],"Properties":null},{"NameSpace":{"Comments":null,"Name":"Using Facebook"},"Directives":null,"ClassDefination":{"Comments":null,"Name":"Your Photos and Videos"},"Methods":[{"Comments":["At the top of your News Feed or timeline, click Photo/Video.","Select the photos you want to share.","If you want, you can:\r\nClick to add more photos.\r\nClick to tag friends. Learn more about how tagging works.\r\nClick to add a location.\r\nClick then click Feeling/Activity to share what you're feeling or doing.\r\nHover over your photo and click Edit to edit your photo.","Click to add more photos.","Click to tag friends. Learn more about how tagging works.","Click to add a location.","Click then click Feeling/Activity to share what you're feeling or doing.","Hover over your photo and click Edit to edit your photo.","Select your audience, then click Post."],"ReturnType":null,"Name":"How do I share photos on Facebook?"},{"Comments":["Go to your friend’s timeline and click Photo/Video at the top.","Choose a photo from your computer, then click Open.","Click Post."],"ReturnType":null,"Name":"How do I post a photo to my friend’s timeline on Facebook?"},{"Comments":["The image you’d like to use: Save in .png or .jpg format.","A depth map for the image: Make sure your map has \"_depth\" appended to the file name (example: myImage_depth.png) and has the same aspect ratio as the image you're using.","Click Photo/Video at the top of your News Feed, a group or your Page.","Select your two files (the image and the depth map), then drag and drop your files onto your post. When the files are added to your post, the 3D image will be created.","Click Post.","Tap What's on your mind? at the top of your News Feed. Tap Write something... in a group or Create a post on a Page.","Tap Photo/Video.","Select your photo and tap Done.","Tap Make 3D in the top left of your photo.","Tap Share or Post.","Tap What's on your mind? at the top of your News Feed. Tap Write something... in a group or on a Page.","Scroll down and tap 3D Photo.","Select the photo you'd like to use.","Tap Share or Post.","3D photos can’t be edited. If you edit a photo using Facebook, your computer or a third-party app, you may not be able to convert it into a 3D photo.","If you’d like to share a 3D photo, you can’t add multiple photos to a post. Only one 3D photo can be shared at a time.","At this time, 3D photos can't be added to an album.","If you're posting a 3D photo from a Page, 3D photos can't be boosted or used in ads at this time."],"ReturnType":null,"Name":"How do I create a 3D photo on Facebook?Computer:"},{"Comments":["The image you’d like to use: Save in .png or .jpg format.","A depth map for the image: Make sure your map has \"_depth\" appended to the file name (example: myImage_depth.png) and has the same aspect ratio as the image you're using.","Click Photo/Video at the top of your News Feed, a group or your Page.","Select your two files (the image and the depth map), then drag and drop your files onto your post. When the files are added to your post, the 3D image will be created.","Click Post.","Tap What's on your mind? at the top of your News Feed. Tap Write something... in a group or Create a post on a Page.","Tap Photo/Video.","Select your photo and tap Done.","Tap Make 3D in the top left of your photo.","Tap Share or Post.","Tap What's on your mind? at the top of your News Feed. Tap Write something... in a group or on a Page.","Scroll down and tap 3D Photo.","Select the photo you'd like to use.","Tap Share or Post.","3D photos can’t be edited. If you edit a photo using Facebook, your computer or a third-party app, you may not be able to convert it into a 3D photo.","If you’d like to share a 3D photo, you can’t add multiple photos to a post. Only one 3D photo can be shared at a time.","At this time, 3D photos can't be added to an album.","If you're posting a 3D photo from a Page, 3D photos can't be boosted or used in ads at this time."],"ReturnType":null,"Name":"How do I create a 3D photo on Facebook?Computer:iPhone:"},{"Comments":["The image you’d like to use: Save in .png or .jpg format.","A depth map for the image: Make sure your map has \"_depth\" appended to the file name (example: myImage_depth.png) and has the same aspect ratio as the image you're using.","Click Photo/Video at the top of your News Feed, a group or your Page.","Select your two files (the image and the depth map), then drag and drop your files onto your post. When the files are added to your post, the 3D image will be created.","Click Post.","Tap What's on your mind? at the top of your News Feed. Tap Write something... in a group or Create a post on a Page.","Tap Photo/Video.","Select your photo and tap Done.","Tap Make 3D in the top left of your photo.","Tap Share or Post.","Tap What's on your mind? at the top of your News Feed. Tap Write something... in a group or on a Page.","Scroll down and tap 3D Photo.","Select the photo you'd like to use.","Tap Share or Post.","3D photos can’t be edited. If you edit a photo using Facebook, your computer or a third-party app, you may not be able to convert it into a 3D photo.","If you’d like to share a 3D photo, you can’t add multiple photos to a post. Only one 3D photo can be shared at a time.","At this time, 3D photos can't be added to an album.","If you're posting a 3D photo from a Page, 3D photos can't be boosted or used in ads at this time."],"ReturnType":null,"Name":"How do I create a 3D photo on Facebook?Computer:iPhone:Android:"},{"Comments":["At the top of your News Feed, click Photo/Video below What's on your mind, [Name]?.","Select the photos you'd like to share.","Hover over the photos and click Edit All, then hover over the photo you'd like to edit and click Edit.","Click to choose your edit option on the left. You can:\r\nClick Caption to add a caption.\r\nTag friends. Learn more about how tagging works.\r\nCrop your photo.\r\nRotate your photo.","Click Caption to add a caption.","Tag friends. Learn more about how tagging works.","Crop your photo.","Rotate your photo.","When you're finished with your edits, click Save.","Click , then click Done.","Select your audience, then click Post."],"ReturnType":null,"Name":"How do I edit my photos on Facebook?"},{"Comments":["Click your profile picture in the top right of Facebook.","Click Photos.","Click the photo you want to rotate.","Click next to your name.","Select Rotate Left or Rotate Right."],"ReturnType":null,"Name":"How do I rotate a photo I added on Facebook?"},{"Comments":["Click the photo to open it.","Click in the top right."],"ReturnType":null,"Name":"How do I view a photo in fullscreen mode on Facebook?"},{"Comments":["Click Photo/Video at the top of your News Feed.","Select the photo you want to add.","Hover over the photo and click Edit.","The automatically generated text will be shown on the left side of your photo. Click Override generated alt text to edit it.","Write your alt text in the box. To change back to the automatically generated text, click Clear.","To save your alt text, click Save in the bottom left.","Click the photo to open it.","Click in the top right and select Change Alt Text.","Click Override generated alt text or change the alt text in the text box. You can also click Clear to change your edited alt text back to the automatically generated text.","Click Save."],"ReturnType":null,"Name":"How do I edit the alternative text for a photo on Facebook?"},{"Comments":["Click Photo/Video at the top of your News Feed.","Select the photo you want to add.","Hover over the photo and click Edit.","The automatically generated text will be shown on the left side of your photo. Click Override generated alt text to edit it.","Write your alt text in the box. To change back to the automatically generated text, click Clear.","To save your alt text, click Save in the bottom left.","Click the photo to open it.","Click in the top right and select Change Alt Text.","Click Override generated alt text or change the alt text in the text box. You can also click Clear to change your edited alt text back to the automatically generated text.","Click Save."],"ReturnType":null,"Name":"How do I edit the alternative text for a photo on Facebook?"},{"Comments":["Click What's on your mind, [Name]? at the top of your News Feed.","Click and choose a video.","Select your audience, then click Post."],"ReturnType":null,"Name":"How do I post a video on Facebook?"},{"Comments":["Click your profile picture in the top right of Facebook.","Go to your video post you'd like to change.","Click the audience selector at the top of the post (example: ).","Choose an audience for your video."],"ReturnType":null,"Name":"How do I change who can see my videos on Facebook?"},{"Comments":["Click Photo/Video at the top of your News Feed or timeline.","Select the HD video you'd like to share.","Select your audience, then click Post."],"ReturnType":null,"Name":"How can I upload videos to Facebook in HD?"},{"Comments":["Open Facebook on a computer.","Go to the video you want to embed.","Click and select Embed. Keep in mind that you will only see this option if the video's audience is set to Public.","Copy the code that appears and paste it on your website or web page."],"ReturnType":null,"Name":"How do I embed a video from Facebook onto a website?"},{"Comments":["Click What's on your mind, [Name]? at the top of your News Feed.","Click then click Live Video.","Write something about your live video.","Click Go Live in the bottom left."],"ReturnType":null,"Name":"How do I go live on Facebook?"},{"Comments":["From your News Feed, click Groups in the left menu and select the group you’d like to go live in.","Click What's on your mind?","Click , then click Live Video.","In the left menu, select whether you'd like to Go Live Now or Schedule a Live Video for a future time and date.","Add a title and description to your post. Here you can also tag friends, check in to a location, or add a feeling or activity.","Click Go Live in the bottom left."],"ReturnType":null,"Name":"How do I go live in a Facebook group?"},{"Comments":["From your News Feed, click Pages in the left menu.","Go to your Page.","Click Live next to Create.","Click Use Stream Keys below Get Started and select Camera to use a web camera for your video.","In the left menu, select whether you'd like to Go Live Now or Schedule a Live Video for a future time and date.","Add a title and description to your live video. Here you can also check in to a location, or add a feeling or activity.","Click Go Live in the bottom left."],"ReturnType":null,"Name":"How do I go live from my Facebook Page?"},{"Comments":["Click What's on your mind? at the top of your News Feed.","Click then click Live Video.","Click Schedule Live Video Event in the left column.","In the left column, select where you’d like to broadcast your live video (to your timeline, a Page you manage, or in a group).","Give your event a name.","Select the date and time of your live video.","Select what privacy setting you want for your live video.","Click Next.","Click Upload Cover Photo or Choose Illustration to add a photo to your live video announcement. If you do not add a photo, the default will be your cover photo.","Click Create Event in the bottom left.","An announcement post. The details of your upcoming live broadcast are published to your profile, Page or group as soon as you schedule your live video.","Your live video post. At the scheduled date and time of your broadcast, a post containing your live video will automatically be published to your profile, Page or group."],"ReturnType":null,"Name":"How do I schedule a live video on Facebook?"},{"Comments":["Click What's on your mind? at the top of your News Feed.","Click then click Live Video.","Click Schedule Live Video Event in the left column.","In the left column, select where you’d like to broadcast your live video (to your timeline, a Page you manage, or in a group).","Give your event a name.","Select the date and time of your live video.","Select what privacy setting you want for your live video.","Click Next.","Click Upload Cover Photo or Choose Illustration to add a photo to your live video announcement. If you do not add a photo, the default will be your cover photo.","Click Create Event in the bottom left.","An announcement post. The details of your upcoming live broadcast are published to your profile, Page or group as soon as you schedule your live video.","Your live video post. At the scheduled date and time of your broadcast, a post containing your live video will automatically be published to your profile, Page or group."],"ReturnType":null,"Name":"How do I schedule a live video on Facebook?"},{"Comments":["Go to https://www.facebook.com/live/create.","Click Create Live Stream.","Choose where you want to post your live broadcast.","Select Use a persistent stream key if you want your stream key to be permanent. If this isn't selected, you won't be able to use this stream key again after the stream ends.","Copy and paste the server URL and stream key or persistent stream key into the settings of your streaming software and start the video stream from your encoder. A preview screen will appear.","Write a description and title for your live stream.","Click Go Live Now. If you want to schedule your broadcast for later, click Schedule a Live Video."],"ReturnType":null,"Name":"How do I go live on Facebook using streaming software?"},{"Comments":["Enter \"Live Producer\" as a Page Admin from any Live entry point.","In the description box on the left, select Raise Money.","Select a nonprofit or fundraiser for others to donate to.","Select Go Live."],"ReturnType":null,"Name":"How do I add a donate button to my live video on Facebook?"},{"Comments":["Open the Facebook app for iOS or Android.","Tap Live at the top of your News Feed.","Tap Start Live Video.","Tap to add an effect."],"ReturnType":null,"Name":"How do I add effects to my live video on Facebook?"},{"Comments":["Log into the Facebook app for iOS or Android.","Tap Live at the top of your News Feed.","Tap then tap .","Tap to choose a color, then use your fingertip to draw on your video."],"ReturnType":null,"Name":"How do I draw on my live video on Facebook?"},{"Comments":["Below a post, click Share in the bottom right.","Select where you want to share the post. Depending on the post's privacy settings, you may see the following options:\r\nShare Now (Friends)\r\nShare...\r\nSend as Message\r\nShare in a Group\r\nShare on a Friend's Timeline\r\nShare to a Page"],"ReturnType":null,"Name":"How do I share a live video on Facebook after it’s ended?"},{"Comments":["Log into Facebook on a computer.","After your live stream has ended, click your profile picture in the top left corner.","Click More, then click Videos.","Click Your Videos, then click the video you’d like to download from your video library.","Click in the bottom right, then click Download Video. Your window will refresh automatically to show only your video.","Click , then click Download. Your video will automatically save to your computer."],"ReturnType":null,"Name":"Can I save my Facebook live video to my computer after it’s ended?"},{"Comments":["Click your profile picture in the top right of Facebook.","Click Photos, then click + Create Album.","Click Upload Photos or Videos and select photos or videos from your computer to add to your album, then click Open.","Enter an album name. You can also:\r\nAdd a description.\r\nSelect your audience (example: Public, Friends).","Add a description.","Select your audience (example: Public, Friends).","Click Post."],"ReturnType":null,"Name":"How do I create an album on Facebook?"},{"Comments":["Click your profile picture in the top right of Facebook.","Click Photos.","Click Albums, then click the album you want to delete.","Click in the top right and select Delete album.","Click Delete Album to confirm."],"ReturnType":null,"Name":"How do I delete an album on Facebook?"},{"Comments":["Click your name in the top right.","Click Photos.","Click Albums, then click on the album with the photo you’d like to move.","Find the photo, then click .","Click Move to another album.","Select the album you’d like to move it to, then click Move photo."],"ReturnType":null,"Name":"How do I move a photo or video between albums on Facebook?To Move Photos Between Albums:"},{"Comments":["Click your profile picture in the top right of Facebook.","Click Photos.","Click Albums and select the album you'd like to add to.","Click + Add to album, then click Upload Photos or Videos.","Choose photos or videos to add, then click Open.","Click Post."],"ReturnType":null,"Name":"How do I add to an existing album on Facebook?"},{"Comments":["Click your name in the left sidebar.","Click Photos, then click Albums.","Click in the top right of the album you'd like to add a contributor to.","Click Edit album.","In the Add Contributors section, enter the names of contributors you want to add.","Click Save."],"ReturnType":null,"Name":"How do I create a shared album on Facebook?"},{"Comments":["Go to the album.","Click in the top right corner.","Select Leave Album."],"ReturnType":null,"Name":"How do I leave a shared album on Facebook?"},{"Comments":["Click your profile picture in the top right of Facebook.","Click Photos, then click Albums.","Go to your shared album.","Click .","Click Edit album.","Below Privacy, click the dropdown menu (example: Public) to choose one of the following settings:\r\nPublic: Anyone may be able to see the photos.\r\nFriends of Album Contributors: Contributors, friends of contributors, people tagged and the friends of people tagged may be able to view the photos.\r\nAlbum Contributors Only: Contributors and people tagged may be able to view the photos.","Public: Anyone may be able to see the photos.","Friends of Album Contributors: Contributors, friends of contributors, people tagged and the friends of people tagged may be able to view the photos.","Album Contributors Only: Contributors and people tagged may be able to view the photos.","Click Save in the top right."],"ReturnType":null,"Name":"How do I control who can see my shared album on Facebook?"},{"Comments":["Click your profile picture in the top right of Facebook.","Click Photos, then click Albums.","Click in the top right of the shared album.","Click Edit album.","Below Add Contributors, click x next to the name of the contributor you'd like to remove.","Click Save."],"ReturnType":null,"Name":"How do I remove contributors from a shared album on Facebook?"},{"Comments":["Click your profile picture in the top right of Facebook.","Click Photos, then click Albums.","Click the album you want to change the privacy settings for.","Click in the top right, then click Edit album.","Click Friends to control who can see your album.","Click Save."],"ReturnType":null,"Name":"How do I edit the privacy settings for my photo albums on Facebook?"},{"Comments":["At the top of your News Feed, click Photo/Video below What's on your mind, [Name]?.","Select the photo you want to share.","Hover over the photo and click Edit in the top left.","Click Tag Photo, then click a person in the photo and start typing their name.","Select the full name of the person or Page you want to tag when it appears.","When you're finished tagging people, click Save, then click .","Select the audience for your post, then click Post.","Click the photo you want to tag.","Click in the top right of the photo.","Click the person in the photo and start typing their name.","Select the full name of the person or Page you want to tag when it appears.","Click Done Tagging.","You can tag up to 50 people or Pages in a photo.","When you tag someone in a photo, that person's friends may also see, like or comment on the photo.","Your tag may need to be approved by the person you tagged or the person who posted the photo (if it is not yours), depending on their privacy settings for Timeline Review or tag review.","You may not see the option to tag people in photos posted by others, depending on their audience settings."],"ReturnType":null,"Name":"How do I tag people or Pages in photos on Facebook?To tag a photo before you post it:"},{"Comments":["At the top of your News Feed, click Photo/Video below What's on your mind, [Name]?.","Select the photo you want to share.","Hover over the photo and click Edit in the top left.","Click Tag Photo, then click a person in the photo and start typing their name.","Select the full name of the person or Page you want to tag when it appears.","When you're finished tagging people, click Save, then click .","Select the audience for your post, then click Post.","Click the photo you want to tag.","Click in the top right of the photo.","Click the person in the photo and start typing their name.","Select the full name of the person or Page you want to tag when it appears.","Click Done Tagging.","You can tag up to 50 people or Pages in a photo.","When you tag someone in a photo, that person's friends may also see, like or comment on the photo.","Your tag may need to be approved by the person you tagged or the person who posted the photo (if it is not yours), depending on their privacy settings for Timeline Review or tag review.","You may not see the option to tag people in photos posted by others, depending on their audience settings."],"ReturnType":null,"Name":"How do I tag people or Pages in photos on Facebook?To tag a photo before you post it:To tag a photo that has already been posted:"},{"Comments":["From your News Feed, click Pages in the left menu.","Go to your Page and click the photo you want to tag.","Click in the top right.","Click the person or Page in the photo.","Begin typing the person's or Page's name, then select them from the list that appears.","Click Done Tagging at the bottom.","From your News Feed, click Pages in the left menu.","Go to your Page.","Click Publishing Tools in the left menu.","Click Video Library on the left.","Hover over the video you want to tag, then click > Edit post.","Below the profile picture of your Page, click .","Begin typing the person's or Page's name, then select them from the list that appears.","Click Save."],"ReturnType":null,"Name":"How do I tag other Facebook Pages or people in my Page's photos and videos?To tag other people or Pages in a photo:"},{"Comments":["From your News Feed, click Pages in the left menu.","Go to your Page and click the photo you want to tag.","Click in the top right.","Click the person or Page in the photo.","Begin typing the person's or Page's name, then select them from the list that appears.","Click Done Tagging at the bottom.","From your News Feed, click Pages in the left menu.","Go to your Page.","Click Publishing Tools in the left menu.","Click Video Library on the left.","Hover over the video you want to tag, then click > Edit post.","Below the profile picture of your Page, click .","Begin typing the person's or Page's name, then select them from the list that appears.","Click Save."],"ReturnType":null,"Name":"How do I tag other Facebook Pages or people in my Page's photos and videos?To tag other people or Pages in a photo:To tag other people or Pages in a video:"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","In the left column, click Timeline and Tagging.","Look for the setting Who can see posts you're tagged in on your timeline? and click Edit to the far right.","Select the audience of people (such as Friends) that you'd like to be able to see the posts you've been tagged in."],"ReturnType":null,"Name":"How do I control who sees posts and photos that I’m tagged in on my Facebook timeline?"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","Click Notifications in the left column.","Click Tags to see all your choices.","From here, you can:\r\nChoose the audience you want to get notifications from. Click the circle to the right of the audience (example: Anyone or Friends) to select.\r\nChoose how you want to get the notifications. Click to the right of Push, Email or SMS to select. Learn more about Facebook notifications.","Choose the audience you want to get notifications from. Click the circle to the right of the audience (example: Anyone or Friends) to select.","Choose how you want to get the notifications. Click to the right of Push, Email or SMS to select. Learn more about Facebook notifications."],"ReturnType":null,"Name":"Who can tag me and how do I know if someone tags me on Facebook?To choose what notifications you get about tags:"},{"Comments":["Go to the post.","Click in the top right.","Click Remove tag.","Go to the photo.","Click in the top right.","Select Remove Tag.","Click Ok to confirm.","That tag will no longer appear on the post or photo, but that post or photo is still visible to the audience it's shared with.","People may be able to view the post or photo in places like News Feed or search results."],"ReturnType":null,"Name":"How do I remove a tag from a photo or post I’m tagged in on Facebook?To remove a tag from a post:"},{"Comments":["Go to the post.","Click in the top right.","Click Remove tag.","Go to the photo.","Click in the top right.","Select Remove Tag.","Click Ok to confirm.","That tag will no longer appear on the post or photo, but that post or photo is still visible to the audience it's shared with.","People may be able to view the post or photo in places like News Feed or search results."],"ReturnType":null,"Name":"How do I remove a tag from a photo or post I’m tagged in on Facebook?To remove a tag from a post:To remove a tag from a photo:"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","In the left column, click Timeline and Tagging.","Look for the setting Review posts you're tagged in before the post appears on your timeline? and click Edit to the far right.","Select Enabled or Disabled."],"ReturnType":null,"Name":"How can I use Timeline Review to see posts I'm tagged in before they appear on my Facebook timeline?To turn on Timeline Review or review your Timeline Review settings:"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy > Activity Log.","In the top left of your activity log, click Filter.","Scroll to Photos & Videos and click the circle to select.","Click Privacy: See all and select Privacy: Public. You can also see only the photos you've hidden on your timeline by tapping Visibility: All, then Visibility: Hidden.","Click Save Changes."],"ReturnType":null,"Name":"How do I view my photos and photos I'm tagged in on Facebook that are shared with a public audience?To see photos that are shared publicly:"},{"Comments":["The audience selected by the person who made the post.","The audience you indicate in your Timeline and Tagging settings. You can choose to automatically add your friends, select specific friends or not add anyone to the audience of the post you're tagged in.","Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","In the left column, click Timeline and Tagging.","Look for the setting When you're tagged in a post, who do you want to add to the audience if they aren't already in it? and click Edit to the far right.","Select an audience (example: Only Me).","This setting defaults to Friends, which means when you’re tagged in a post, you and your friends can see the post, even if they weren’t in the original audience.","The post you're tagged in may be shared with the original audience, as well as the friends you suggest. These people may see it in News Feed, search and other places on Facebook."],"ReturnType":null,"Name":"If I'm tagged in a post on Facebook, will my friends be able to see it, even if it wasn't shared with them?When someone tags you in a post, it will be visible to:"},{"Comments":["Click the photo you want to report. If the profile is locked and you can't view the full-sized photo, click Find Support or Report Photo.","Tap in the top right","Select Find support or report photo.","Select the option that best describes the issue and follow the on-screen instructions."],"ReturnType":null,"Name":"How do I report an abusive photo on Facebook?"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy, then click Settings.","In the left column, click Face Recognition.","Go to Do you want Facebook to be able to recognize you in photos and videos? and click Edit.","Select Yes or No to confirm your choice.","Your Facebook experience won't include us recognizing you. Learn more about how the face recognition setting works.","We’ll delete your face recognition template.","We won’t use face recognition to suggest that people tag you in photos. This means that you’ll still be able to be tagged in photos, but we won’t suggest tags based on a face recognition template."],"ReturnType":null,"Name":"How do I turn the face recognition setting on or off for my Facebook account?To turn this setting on or off for your account:"},{"Comments":["Click in the top right of Facebook.","Select Settings & Privacy > Activity Log.","Click Photo review in the top left of your Activity Log. From here you can:\r\nClick Tag Yourself to tag yourself in the photo.\r\nClick Ignore to leave yourself untagged.\r\nClick Not Me to let us know if you're not in the photo.\r\nClick and then click Report Photo to report the photo to Facebook.","Click Tag Yourself to tag yourself in the photo.","Click Ignore to leave yourself untagged.","Click Not Me to let us know if you're not in the photo.","Click and then click Report Photo to report the photo to Facebook.","We will only look for you in photos if you’ve turned on your face recognition setting and you’re in the audience of the photo. For example, if your friend shares a photo you’re in with their friends but doesn’t tag you, we may add that photo to your Photo Review if you’ve turned on your face recognition setting.","You aren't tagged in the photos in Photo Review, so they won't appear on your timeline. But the photos will still be visible in other places on Facebook, such as in News Feed or Search, to the audience they were shared with by the person who originally posted the photo.","If you tag yourself in the photo, your friends may also be able to see the photo. Learn more about who can see photos you're tagged in.","We may be unable to determine that you might be in a photo, even if your face recognition setting is turned on. For example, if a photo is too blurry or if only a portion of your face is visible, our face recognition technology may not be able to recognize you.","Your face recognition setting is off.","There are no new photos of you to review."],"ReturnType":null,"Name":"Can I review photos of me on Facebook that I’m not tagged in?To review photos that you may be in but haven’t been tagged in:"},{"Comments":["Click your profile picture in the top right of Facebook.","Scroll down to the video you'd like to remove.","Click in the top right.","Select Remove Tag, then click OK.","From your profile, click in the top right, then click .","Select Photos and Videos in the left menu.","Click next to the video you'd like to remove.","Select Report/Remove Tag.","Select the option that best describes the issue and follow the on-screen instructions."],"ReturnType":null,"Name":"There’s a video of me on Facebook that I want taken down.To remove the tagged video from your timeline:"},{"Comments":["Click your profile picture in the top right of Facebook.","Scroll down to the video you'd like to remove.","Click in the top right.","Select Remove Tag, then click OK.","From your profile, click in the top right, then click .","Select Photos and Videos in the left menu.","Click next to the video you'd like to remove.","Select Report/Remove Tag.","Select the option that best describes the issue and follow the on-screen instructions."],"ReturnType":null,"Name":"There’s a video of me on Facebook that I want taken down.To remove the tagged video from your timeline:To find and remove the tagged video using your Activity Log:"}],"Properties":null}]